<?xml version="1.0" ?>
<net batch="1" name="weights.04-0.51" version="5">
	<layers>
		<layer id="0" name="input_1" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>118</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv2d_1" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="20" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>1</dim>
					<dim>118</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>20</dim>
					<dim>118</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="720"/>
				<biases offset="720" size="80"/>
			</blobs>
		</layer>
		<layer id="2" name="conv2d_1_activation" precision="FP32" type="ReLU">
			<data negative_slope="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>118</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>20</dim>
					<dim>118</dim>
					<dim>80</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Mul_/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>118</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>20</dim>
					<dim>118</dim>
					<dim>80</dim>
				</port>
			</output>
			<blobs>
				<weights offset="800" size="80"/>
				<biases offset="880" size="80"/>
			</blobs>
		</layer>
		<layer id="4" name="max_pooling2d_1" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="2,2" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="2,2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>118</dim>
					<dim>80</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>20</dim>
					<dim>59</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="conv2d_2" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="40" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>20</dim>
					<dim>59</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>40</dim>
					<dim>59</dim>
					<dim>40</dim>
				</port>
			</output>
			<blobs>
				<weights offset="960" size="28800"/>
				<biases offset="29760" size="160"/>
			</blobs>
		</layer>
		<layer id="6" name="conv2d_2_activation" precision="FP32" type="ReLU">
			<data negative_slope="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>59</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>40</dim>
					<dim>59</dim>
					<dim>40</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Mul_430/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>59</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>40</dim>
					<dim>59</dim>
					<dim>40</dim>
				</port>
			</output>
			<blobs>
				<weights offset="29920" size="160"/>
				<biases offset="30080" size="160"/>
			</blobs>
		</layer>
		<layer id="8" name="max_pooling2d_2" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="1,2" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>59</dim>
					<dim>40</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>40</dim>
					<dim>59</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="conv2d_3" precision="FP32" type="Convolution">
			<data dilations="1,1" group="1" kernel="3,3" output="40" pads_begin="1,1" pads_end="1,1" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>59</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>40</dim>
					<dim>59</dim>
					<dim>39</dim>
				</port>
			</output>
			<blobs>
				<weights offset="30240" size="57600"/>
				<biases offset="87840" size="160"/>
			</blobs>
		</layer>
		<layer id="10" name="conv2d_3_activation" precision="FP32" type="ReLU">
			<data negative_slope="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>59</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>40</dim>
					<dim>59</dim>
					<dim>39</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Mul_427/Fused_Mul_/FusedScaleShift_" precision="FP32" type="ScaleShift">
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>59</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>40</dim>
					<dim>59</dim>
					<dim>39</dim>
				</port>
			</output>
			<blobs>
				<weights offset="88000" size="160"/>
				<biases offset="88160" size="160"/>
			</blobs>
		</layer>
		<layer id="12" name="max_pooling2d_3" precision="FP32" type="Pooling">
			<data exclude-pad="true" kernel="1,2" pads_begin="0,0" pads_end="0,0" pool-method="max" rounding_type="ceil" strides="1,1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>59</dim>
					<dim>39</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>40</dim>
					<dim>59</dim>
					<dim>38</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="flatten_1" precision="FP32" type="Flatten">
			<data axis="1" end_axis="-1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>40</dim>
					<dim>59</dim>
					<dim>38</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>89680</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="dense_1" precision="FP32" type="FullyConnected">
			<data out-size="64"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>89680</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
			<blobs>
				<weights offset="88320" size="22958080"/>
				<biases offset="23046400" size="256"/>
			</blobs>
		</layer>
		<layer id="15" name="dense_1_activation" precision="FP32" type="ReLU">
			<data negative_slope="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="dense_2" precision="FP32" type="FullyConnected">
			<data out-size="32"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>64</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
			<blobs>
				<weights offset="23046656" size="8192"/>
				<biases offset="23054848" size="128"/>
			</blobs>
		</layer>
		<layer id="17" name="dense_2_activation" precision="FP32" type="ReLU">
			<data negative_slope="0"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="dense_3" precision="FP32" type="FullyConnected">
			<data out-size="2"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>32</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
			<blobs>
				<weights offset="23054976" size="256"/>
				<biases offset="23055232" size="8"/>
			</blobs>
		</layer>
		<layer id="19" name="dense_3_activation" precision="FP32" type="SoftMax">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>1</dim>
					<dim>2</dim>
				</port>
			</output>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="1" to-port="0"/>
		<edge from-layer="1" from-port="3" to-layer="2" to-port="0"/>
		<edge from-layer="2" from-port="1" to-layer="3" to-port="0"/>
		<edge from-layer="3" from-port="3" to-layer="4" to-port="0"/>
		<edge from-layer="4" from-port="1" to-layer="5" to-port="0"/>
		<edge from-layer="5" from-port="3" to-layer="6" to-port="0"/>
		<edge from-layer="6" from-port="1" to-layer="7" to-port="0"/>
		<edge from-layer="7" from-port="3" to-layer="8" to-port="0"/>
		<edge from-layer="8" from-port="1" to-layer="9" to-port="0"/>
		<edge from-layer="9" from-port="3" to-layer="10" to-port="0"/>
		<edge from-layer="10" from-port="1" to-layer="11" to-port="0"/>
		<edge from-layer="11" from-port="3" to-layer="12" to-port="0"/>
		<edge from-layer="12" from-port="1" to-layer="13" to-port="0"/>
		<edge from-layer="13" from-port="1" to-layer="14" to-port="0"/>
		<edge from-layer="14" from-port="3" to-layer="15" to-port="0"/>
		<edge from-layer="15" from-port="1" to-layer="16" to-port="0"/>
		<edge from-layer="16" from-port="3" to-layer="17" to-port="0"/>
		<edge from-layer="17" from-port="1" to-layer="18" to-port="0"/>
		<edge from-layer="18" from-port="3" to-layer="19" to-port="0"/>
	</edges>
	<meta_data>
		<MO_version value="2019.1.0-341-gc9b66a2"/>
		<cli_parameters>
			<data_type value="float"/>
			<disable_fusing value="False"/>
			<disable_gfusing value="False"/>
			<disable_omitting_optional value="False"/>
			<disable_resnet_optimization value="False"/>
			<enable_concat_optimization value="False"/>
			<enable_flattening_nested_params value="False"/>
			<extensions value="DIR"/>
			<framework value="caffe"/>
			<generate_deprecated_IR_V2 value="False"/>
			<input_model value="DIR\weights.04-0.51.caffemodel"/>
			<input_proto value="DIR\weights.04-0.51.prototxt"/>
			<k value="DIR\CustomLayersMapping.xml"/>
			<keep_shape_ops value="False"/>
			<log_level value="ERROR"/>
			<mean_scale_values value="{}"/>
			<mean_values value="()"/>
			<move_to_preprocess value="False"/>
			<output_dir value="DIR"/>
			<reverse_input_channels value="False"/>
			<scale_values value="()"/>
			<silent value="False"/>
			<version value="False"/>
			<unset unset_cli_parameters="batch, finegrain_fusing, freeze_placeholder_with_value, input, input_shape, mean_file, mean_file_offsets, model_name, output, placeholder_shapes, scale"/>
		</cli_parameters>
	</meta_data>
</net>
